upgrade the README
