--- a/README.md
+++ b/README.md
@@ -1,268 +1,181 @@
-
 Os dados serão armazenados localmente e posteriormente enviados para a API quando a conexão estiver disponível.
 
-```text
-          Técnico
-             │
-             ▼
-      ┌──────────────┐
-      │  Aplicativo  │
-      └──────┬───────┘
-             │
-       Sem conexão
-             │
-             ▼
-      ┌──────────────┐
-      │    SQLite    │
-      │              │
-      │ Dados locais │
-      │    Outbox    │
-      └──────┬───────┘
-             │
-        Conexão volta
-             │
-             ▼
-      ┌──────────────┐
-      │ Sincronização│
-      └──────┬───────┘
-             │
-             ▼
-        ┌─────────┐
-        │ API REST│
-        └────┬────┘
-             │
-             ▼
-        PostgreSQL
+```mermaid
+---
+config:
+  theme: base
+  themeVariables:
+    primaryColor: '#17d1a69a'
+    primaryTextColor: '#096b54'
+    primaryBorderColor: '#0000008a'
+    lineColor: '#000000a9'
+---
+flowchart TD
+    TECH[Técnico]
+    APP[Aplicativo]
+    SQLITE[(SQLite<br/>Dados locais<br/>Outbox)]
+    SYNC[SINCRONIZAÇÃO]
+    API[API REST]
+    DB[(PostgreSQL)]
+
+    TECH --> APP
+    APP -->|Sem conexão| SQLITE
+    SQLITE -->|Conexão volta| SYNC
+    SYNC --> API
+    API --> DB
 ```
 
-### Outbox
+<hr style="background-color: #17d1a646">
